{"html": {"pregunta-1": {"name": "<strong>1) ¿Qué es HTML?</strong>", "opciones": ["Opción 1", "Opción 2", "HTML es la abreviatura de HyperText Markup Language: es el lenguaje de la World Wide Web. Es un lenguaje de formato de texto estándar usado para crear y mostrar páginas en la Web. Los documentos HTML están compuestos de dos cosas: contenido y &nbsp;etiquetas que le dan formato para que se muestre correctamente en las páginas."], "correcta": "2"}, "pregunta-2": {"name": "<strong>2) ¿Qué son las etiquetas?</strong>", "opciones": ["Opción 1", "Opción 2", "Es el contenido que se coloca entre las etiquetas HTML, con la finalidad de darle formato correctamente. Usa el símbolo menor que (&lt;) y el mayor que (&gt;). Un símbolo de barra oblicua también se utiliza como etiqueta de cierre <strong>Ejemplo:</strong>&lt;strong&gt;sample&lt;/strong&gt;"], "correcta": "2"}, "pregunta-3": {"name": "<strong>3) ¿Todas las etiquetas HTML vienen en pares?</strong>", "opciones": ["No, algunas etiquetas HTML simples, &nbsp;no necesitan una etiqueta de cierre. Algunos ejemplos son las etiquetas &lt;img&gt; y &lt;br&gt;.", "Opción 2", "Opción 3"], "correcta": "0"}, "pregunta-4": {"name": "<strong>4) ¿Cuáles son algunas de las listas comunes que se pueden utilizar al diseñar una página?</strong>", "opciones": ["Opción 1", "Se puede insertar cualquiera o una combinación de los siguientes tipos de lista:<br>- &nbsp;clasificada<br>- &nbsp;no ordenada<br>- de definiciones<br>- &nbsp;de menú<br>- &nbsp;de directorio<br>Estos tipos de lista, cada uno usa un conjunto de etiquetas distintas para componer", "Opción 3"], "correcta": "1"}, "pregunta-5": {"name": "<strong>5) ¿Cómo se inserta un comentario en HTML?</strong>", "opciones": ["Los comentarios en HTML empiezan con \"&lt;!-\" y terminan con \"-&gt;\".<strong>Ejemplo</strong>:&lt;!-- A SAMPLE COMMENT --&gt;", "Opción 2", "Opción 3"], "correcta": "0"}, "pregunta-6": {"name": "<strong>6) ¿Todas las entidades de caracteres se muestran correctamente en todos los sistemas?</strong>", "opciones": ["Opción 1", "Opción 2", "No, &nbsp;algunas entidades de caracteres no se pueden mostrar, cuando el sistema operativo en el que se ejecuta el navegador no admite los caracteres. Cuando sucede esto, los caracteres se presentan como cuadros."], "correcta": "2"}, "pregunta-7": {"name": "<strong>7) ¿Qué es un mapa de imagen?</strong>", "opciones": ["Opción 1", "Opción 2", "El mapa de imágenes permite enlazar muchas páginas web distintas, usando una sola imagen. También, puede definir formas en las imágenes que desea que formen parte de un mapeo de imágenes."], "correcta": "2"}, "pregunta-8": {"name": "<strong>8) ¿Cuál es la ventaja de colapsar el espacio en blanco?</strong>", "opciones": ["Opción 1", "Son una secuencia en blanco de caracteres de espacio, que se trata como un carácter de espacio único en HTML. Motivado a que el navegador colapsa múltiples espacios en un solo espacio, puede sangrar líneas de texto sin preocuparse por los muchos espacios. Esto permite organizar el código HTML en un formato &nbsp;más legible.", "Opción 3"], "correcta": "1"}, "pregunta-9": {"name": "<strong>9) ¿Se pueden establecer valores de atributo para cualquier cosa o hay valores específicos que ellos aceptan?</strong>", "opciones": ["Algunos valores de atributo sólo &nbsp;pueden establecerse en valores predefinidos. Otros atributos aceptan cualquier valor numérico, que represente el número de píxeles de un tamaño.", "Opción 2", "Opción 3"], "correcta": "0"}, "pregunta-10": {"name": "<strong>10) ¿Cómo se inserta un símbolo de copyright en una página del navegador?</strong>", "opciones": ["Para insertar el símbolo de copyright, se tiene que escribir &amp;copy; o &amp; #169; en&nbsp; un archivo HTML.", "Opción 2", "Opción 3"], "correcta": "0"}, "pregunta-11": {"name": "<strong>11) ¿Cómo se crean enlaces a secciones dentro de la misma página?</strong>", "opciones": ["Opción 1", "Los enlaces se crean usando la etiqueta &lt;a&gt;, con referencia mediante el uso del símbolo del número (#). <strong>Ejemplo</strong>: puede tener una línea como &lt;a href=\"#Los mejores\"&gt;Volver a la parte superior &lt;/a&gt;, lo que da lugar a la aparición de las palabras 'Volver a la parte superior' en la página web y enlaces a un marcador llamado 'Los mejores'. A continuación, se escribe un comando de etiqueta separado como &lt;a name=\"Los mejores\"&gt; en algún lugar en la parte superior de la misma página web para que el usuario esté vinculado a ese punto cuando haga clic en 'Volver a la parte superior'.", "Opción 3"], "correcta": "1"}, "pregunta-12": {"name": "<strong>12) ¿Hay alguna manera de mantener los elementos de la lista directamente en un archivo HTML?</strong>", "opciones": ["Opción 1", "Opción 2", "Se puede hacer usando sangrías para mantener los elementos de lista rectos. Si se usa sangria cada lista subanunciada más allá de la lista matriz que la contiene puedes determinar de un simple vistazo las diferentes listas y los elementos que contiene."], "correcta": "2"}, "pregunta-13": {"name": "<strong>13) Si ves una dirección web en una revista, ¿a qué página web apunta?</strong>", "opciones": ["Opción 1", "Cada página web en la web puede tener una dirección web por separado. Casi todas estas direcciones son relativas a la página web de mayor importancia. La dirección web publicada en las revistas normalmente apunta a la más importante. Desde esta página, puede entrar a las demás páginas del sitio web.", "Opción 1"], "correcta": "1"}, "pregunta-14": {"name": "<strong>14) ¿Cuál es el uso del texto alternativo en el mapeo de imágenes?</strong>", "opciones": ["Opción 1", "Opción 2", "Se usa el texto alternativo, cuando se utilizan mapas de imágenes para poder poner un texto descriptivo en cada enlace de zona activa."], "correcta": "2"}, "pregunta-15": {"name": "<strong>15) ¿Funcionan los archivos HTML más antiguos en los navegadores más nuevos?</strong>", "opciones": ["Opción 1", "Sí, los archivos HTML antiguos son compatibles con el estándar HTML, y puede ser posible que algunas funciones no funcionen.", "Opción 3"], "correcta": "1"}, "pregunta-16": {"name": "<strong>16) ¿Un hipervínculo se aplica sólo al texto?</strong>", "opciones": ["No, los hipervínculos se pueden usar en el texto y en las imágenes. Lo que indica &nbsp;que puede convertir una imagen en un enlace, que permita a los usuarios enlazar a otra página al hacer clic. Rodee la imagen dentro de las combinaciones de etiquetas &lt;a href=\" \"&gt;...&lt;/a&gt;.", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-17": {"name": "<strong>17) Si el sistema operativo del usuario no soporta el carácter necesario, ¿cómo se puede representar el símbolo?</strong>", "opciones": ["Opción 1", "Se puede mostrar como una imagen.", "Opción 1"], "correcta": "1"}, "pregunta-18": {"name": "<strong>18) ¿Cómo se cambia el tipo de número en el medio de una lista?</strong>", "opciones": ["El atributo type puede usarse para cambiar el tipo de numeración de cualquier elemento de la lista. El atributo de valor puede cambiar el índice numérico<strong>.</strong>", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-19": {"name": "<strong>19) ¿Qué son las hojas de estilo?</strong>", "opciones": ["Las hojas de estilo: son las que permiten crear plantillas de estilo consistentes, transportables y definidas. Estas plantillas se vinculan a varias páginas web distintas, que facilita el mantenimiento y cambio de aspecto de las páginas web dentro del sitio. ", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-20": {"name": "<strong>20) Indique los tipos de viñetas disponibles en HTML </strong>", "opciones": ["Opción 1", "Con las listas ordenadas, puedes utilizar distintas viñetas, incluyendo números alfabéticos y romanos. El atributo de tipo para listas desordenadas&nbsp; puede ser cuadrado, disco o círculo.<strong>&nbsp;</strong>", "Opción 1"], "correcta": "1"}, "pregunta-21": {"name": "<strong>21) ¿Cómo se crea un texto multicolor en una página web?</strong>", "opciones": ["Opción 1", "Opción 1", "Para crear texto con muchos colores, usa &nbsp;etiquetas &lt;font color=\"color\"&gt;...&lt;/font&gt; para cada carácter que desee aplicar color. Puede usar la combinación de etiquetas tantas veces como se necesite, rodeando un solo carácter o una palabra entera. "], "correcta": "2"}, "pregunta-22": {"name": "<strong>22) ¿Por qué hay valores de entidades de caracteres numéricos y de caracteres con nombre?</strong>", "opciones": ["Opción 1", "Los valores numéricos se toman de los valores ASCII de los diferentes caracteres, pero a veces son difíciles de recordar. Motivado a esto, se crearon valores de entidades de caracteres con nombre que facilitan a los diseñadores de páginas web su uso. ", "Opción 1"], "correcta": "1"}, "pregunta-23": {"name": "<strong>23) Escriba una secuencia de etiquetas de tabla HTML que produzca lo siguiente:<br>50 unidades 100 500<br>10 unidades 5 50<br></strong>", "opciones": ["Opción 1", "Opción 1", "&lt;table&gt; <br>&lt;tr&gt; <br>&lt;td&gt;50 pcs&lt;/td&gt; <br>&lt;td&gt; <br>100&lt;/td&gt; <br>&lt;td&gt;500&lt;/td&gt; <br>&lt;/tr&gt; <br>&lt;tr&gt; <br>&lt;td&gt;10 pcs&lt;/td&gt; <br>&lt;td&gt;5&lt;/td&gt; <br>&lt;td&gt;50&lt;/td&gt; <br>&lt;/tr&gt; <br>&lt;/table&gt; <br>"], "correcta": "2"}, "pregunta-24": {"name": "<strong>24) ¿Cuál es la ventaja de agrupar varias casillas de verificación?</strong>", "opciones": ["Opción 1", "Agruparlas ayuda a organizarlas. Los botones de la casilla de verificación pueden tener su nombre y no es necesario que pertenezcan a un grupo. Una sola página web puede tener muchos grupos, distintos de casillas de verificación.", "Opción 1"], "correcta": "1"}, "pregunta-25": {"name": "<strong>25) ¿Qué sucederá si se superponen conjuntos de etiquetas?</strong>", "opciones": ["Sólo puede ser reconocida la primera etiqueta. Este problema lo vas a encontrar cuando el texto no se muestre correctamente en la pantalla del navegador.", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-26": {"name": "<strong>26) ¿Qué son los applets?</strong>", "opciones": ["Los applets son programas pequeños que pueden incrustarse en las páginas web para realizar alguna función específica como animaciones, cálculos y procesamiento de información. Los applets están escritos en lenguaje Java.", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-27": {"name": "<strong>27) ¿Qué pasa si no hay texto entre las etiquetas o si un texto fue omitido por error? ¿Afectará la visualización del archivo HTML?</strong>", "opciones": ["Opción 1", "Si no hay texto entre las etiquetas, tampoco hay nada que darle formato. Por lo que, no aparecerá ningún formato. Algunas etiquetas, como una etiqueta de cierre como la etiqueta &lt;img&gt; no necesitan texto entre ellas.", "Opción 1"], "correcta": "1"}, "pregunta-28": {"name": "<strong>28) ¿Es posible establecer colores específicos para los bordes de las tablas?</strong>", "opciones": ["Opción 1", "Opción 1", "Si, usando hojas de estilo pero los colores en una tabla que no usen hojas de estilo serán los mismos que los del color del texto."], "correcta": "2"}, "pregunta-29": {"name": "<strong>29) ¿Cómo se crea un enlace que se conectará a otra página web cuando se hace clic en él?</strong>", "opciones": ["Utilice la etiqueta href. El formato general para esto es: &lt;a href=\"sitio\"&gt;texto&lt;/a&gt; reemplazando \"sitio\" con la URL real de la página, a la que se supone que está vinculado cuando se hace clic en el texto.", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-30": {"name": "<strong>30) ¿Qué otras formas se pueden utilizar para alinear las imágenes y envolver el texto?</strong>", "opciones": ["Opción 1", "Una forma útil de envolver el texto alrededor de una imagen es usar hojas de estilo o tablas. ", "Opción 1"], "correcta": "1"}, "pregunta-31": {"name": "<strong>31) ¿Un solo enlace de texto puede apuntar a dos páginas web diferentes?</strong>", "opciones": ["No. La etiqueta &lt;a&gt; sólo acepta un único atributo href, y apuntar a una sola página web.", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-32": {"name": "<strong>32) ¿Cuál es la diferencia entre las listas de directorios y menús y las listas desordenadas?</strong>", "opciones": ["Opción 1", "Opción 1", "La diferencia es que el directorio y las listas de menús no incluyen atributos que permita cambiar el estilo de la viñeta."], "correcta": "2"}, "pregunta-33": {"name": "<strong>33) ¿Se puede cambiar el color de las viñetas?</strong>", "opciones": ["Opción 1", "Opción 1", "El color de viñeta es el mismo que el del primer carácter del elemento de la lista. Si rodea el &lt;li&gt; y el primer carácter con un grupo de etiquetas &lt;font&gt; con el conjunto de atributos de color, el color de &nbsp;viñeta y el primer carácter, serán de&nbsp; color distinto al del texto."], "correcta": "2"}, "pregunta-34": {"name": "<strong>34) ¿Cuáles son los límites del tamaño del campo de texto?</strong>", "opciones": ["Opción 1", "El tamaño de un campo de texto predeterminado es de unos 13 caracteres. Sin embargo, si incluye el atributo size se puede establecer que el valor del tamaño sea tan bajo como 1. El valor del tamaño máximo esta determinado por el ancho del navegador. Si el atributo size se establece en 0, el tamaño se establecerá en el tamaño de 13 caracteres.", "Opción 1"], "correcta": "1"}, "pregunta-35": {"name": "<strong>35) ¿Las etiquetas &lt;th&gt; siempre tienen que ir al principio de una fila o columna?</strong>", "opciones": ["Toda etiqueta &lt;tr&gt; se puede cambiar por una etiqueta &lt;th&gt;. Esto hace que el texto que está en la etiqueta &lt;th&gt; se muestre en negrita en el navegador. Aunque las etiquetas &lt;th&gt; se usan principalmente para los headings, no es necesario usarlas solo para ellos.", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-36": {"name": "<strong>36) ¿Cuál es la relación entre los atributos 'border' y 'rule'?</strong>", "opciones": ["Opción 1", "Opción 1", "Los bordes de celda tienen predeterminados un grosor de 1 píxel, los cuales se añaden en forma automática entre celdas si el atributo 'border' se establece en un valor diferente de cero. De igual manera, si el atributo border no se incluye, aparece un borde predeterminado de 1 píxel, si el atributo rules se adhiere a la etiqueta &lt;table&gt;."], "correcta": "2"}, "pregunta-37": {"name": "<strong>37) ¿Qué es un 'marquee'?</strong>", "opciones": ["Opción 1", "Una Marquee te permite poner &nbsp;un texto de desplazamiento en una página web. Para ello, &nbsp;se coloca cualquier texto que desees que aparezca desplazándose dentro de las etiquetas &lt;marquee&gt; y &lt;/marquee&gt;.", "Opción 1"], "correcta": "1"}, "pregunta-38": {"name": "<strong>38) ¿Cómo se crea un texto en una página web que le permitirá enviar un correo electrónico al hacer clic?</strong>", "opciones": ["Opción 1", "Utilizando el comando mailto dentro de la etiqueta href. <strong>Ejemplo:</strong>&lt;a href=”mailto:youremailaddress”&gt;text to be clicked&lt;/a&gt;", "Opción 1"], "correcta": "1"}, "pregunta-39": {"name": "<strong>39) ¿Son las etiquetas &lt;br&gt; la única manera de separar secciones de texto?</strong>", "opciones": ["No. La etiqueta &lt;br&gt; es una manera de separar líneas de texto. Hay otras etiquetas, como &lt;p&gt; y &lt;blockquote&gt;, que &nbsp;también sirven para separar secciones de texto.", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-40": {"name": "<strong>40) ¿Hay casos en los que el texto aparecerá fuera del navegador?</strong>", "opciones": ["Opción 1", "Si el texto forma parte de una celda de tabla con un ancho definido, el texto puede extenderse más allá de la ventana del navegador.", "Opción 1"], "correcta": "1"}, "pregunta-41": {"name": "<strong>41) ¿En qué se diferencian los enlaces activos de los enlaces normales?</strong>", "opciones": ["Opción 1", "Opción 1", "El color para los enlaces normales y activos es el azul. Varios navegadores reconocen un enlace activo, cuando el cursor del ratón se coloca sobre ese enlace. Se consideran normales aquellos que no tienen un cursor de ratón sobre ese enlace."], "correcta": "2"}, "pregunta-42": {"name": "<strong>42) ¿Limitan las hojas de estilo el número de nuevas definiciones de estilo que se pueden incluir entre paréntesis?</strong>", "opciones": ["Opción 1", "Las hojas de estilo no limitan el número de definiciones de estilo que pueden ser incluidas entre paréntesis para un selector determinado.", "Opción 1"], "correcta": "1"}, "pregunta-43": {"name": "<strong>43) ¿Puedo especificar valores fraccionarios como 670 o 973 para el grosor de la fuente (font-weight)?</strong>", "opciones": ["Eso depende del navegador, pero el estándar no soporta valores de peso fraccionarios. Los valores para ser aceptados deben terminar con dos ceros.", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-44": {"name": "<strong>44) ¿Cuál es la jerarquía que se sigue cuando se trata de hojas de estilo?</strong>", "opciones": ["La definición más cercana a la etiqueta real tiene prioridad. El estilo en línea tiene prioridad sobre hojas de estilo incrustadas que tienen prioridad sobre hojas de estilo externas.", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-45": {"name": "<strong>45) ¿Pueden agruparse varios selectores con nombres de clase?</strong>", "opciones": ["Opción 1", "Se puede definir varios selectores con la misma definición de estilo haciendo la separación con comas. Esta técnica también puede funcionar para selectores con nombres de clase.", "Opción 1"], "correcta": "1"}, "pregunta-46": {"name": "<strong>46) ¿Qué sucede si se abre el archivo CSS externo en un navegador?</strong>", "opciones": ["Opción 1", "Opción 1", "La única forma de usar un archivo CSS externo es haciendo referencia a él utilizando &lt;link/&gt; tag dentro de otro documento HTML. Esto es porque cuando se intenta abrir el archivo CSS externo en un navegador, el navegador no lo puede abrir porque el archivo tiene una extensión distinta."], "correcta": "2"}, "pregunta-47": {"name": "<strong>47) ¿Cómo se convierte una imagen en una imagen de fondo de una página web?</strong>", "opciones": ["Opción 1", "Utilizando un código de etiqueta después de la etiqueta &lt;/head&gt; como se indica: &lt;body background = \"image.gif\"&gt; . Reemplace image.gif con el nombre de su archivo de imagen. Esto toma la foto y la convierte en la imagen de fondo de su página web.", "Opción 1"], "correcta": "1"}, "pregunta-48": {"name": "<strong>48) ¿Qué sucede si la propiedad tipo lista se utiliza en un elemento no listado como un párrafo?</strong>", "opciones": ["La propiedad va a ser &nbsp;ignorada y no afectará al párrafo.", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-49": {"name": "<strong>49) ¿Cuándo es apropiado usar frames?</strong>", "opciones": ["Opción 1", "Opción 1", "Los frames (marcos) hacen que la navegación por un sitio sea más fácil. Si los enlaces principales hacia el sitio están en un frame que aparece en la parte superior o a lo largo del borde del navegador el contenido de los enlaces se muestra en el resto de la ventana del navegador."], "correcta": "2"}, "pregunta-50": {"name": "<strong>50) ¿Qué sucede si el número de valores en las filas o el atributo cols no suma el 100 por ciento?</strong>", "opciones": ["Opción 1", "El navegador calcula el tamaño de los marcos en relación con la suma total de los valores. Si el atributo cols se establece en 100%, 200% &nbsp;y tienen menos del 100%, no va a mostrar los dos marcos verticales.", "Opción 1"], "correcta": "1"}, "pregunta-51": {"name": "<strong>51) ¿Qué navegadores soportan HTML5?</strong>", "opciones": ["Opción 1", "Las últimas versiones de Google Opera, Apple Safari, Chrome, y Mozilla Firefox &nbsp;son compatibles con casi todas las funciones HTML5.", "Opción 1"], "correcta": "1"}, "pregunta-52": {"name": "<strong>52) Nombra dos nuevas etiquetas incluidas en el HTML 5</strong>", "opciones": ["Opción 1", "Opción 1", "<strong>&nbsp;</strong>&lt;Video&gt; y &lt;Audio&gt; son nuevas etiquetas que están incluidas en la versión HTML5. Se usan generalmente como sustituto de Flash, Silverlight, y tecnologías similares para hacer la reproducción de elementos multimedia."], "correcta": "2"}, "pregunta-53": {"name": "<strong>53) ¿Sabes cuáles son las dos etiquetas semánticas que se incluyen en la versión HTML5?</strong>", "opciones": ["Las etiquetas semánticas incluidas recientemente en HTML5 son &lt;article&gt; y &lt;section&gt;. Una etiqueta de artículo representa un bloque completo de contenido que es una sección más grande.", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-54": {"name": "<strong>54) ¿Qué es &lt;figure&gt; en HTML5?</strong>", "opciones": ["Opción 1", "Es la etiqueta que representa una pieza de contenido de flujo autónomo.&nbsp; Utilizada como unidad única y referencia del flujo principal del documento.", "Opción 1"], "correcta": "1"}, "pregunta-55": {"name": "<strong>55) ¿Para qué sirve el elemento Canvas?</strong>", "opciones": ["Opción 1", "Opción 1", "El elemento lienzo o Canvas&nbsp; ayuda en la construcción gráficos, cuadros, evitar Photoshop y para crear imágenes 2D y colocarlas directamente en el código HTML5."], "correcta": "2"}, "pregunta-56": {"name": "<strong>56) ¿Cuáles son los nuevos elementos FORM disponibles en HTML5?</strong>", "opciones": ["Opción 1", "Opción 1", "Los nuevos formulario en HTML5 ofrecen mayor funcionalidad y mejor que las versiones anteriores. Etiquetas para llevar a cabo estas funciones son:<br>1) &lt;datalist&gt; -&nbsp; etiqueta utilizada para especificar una lista de opciones para &nbsp;controles de entrada.<br>2) &lt;keygen&gt; - &nbsp;etiqueta  que representa un campo generador de pares de claves.<br> 3) &lt;output&gt; - representa el resultado de cualquier cálculo de scripting."], "correcta": "2"}, "pregunta-57": {"name": "<strong>57) Indica dos beneficios del Almacenamiento Web HTML5</strong>", "opciones": ["Opción 1", "Dos beneficios de Almacenamiento Web HTML5 son: <br> -Puede almacenar hasta 10 MB de datos, lo cual es más de lo que tienen las cookies.<br> -Los datos guardados de web, no se pueden transferir con la solicitud HTTP. Esto aumenta el rendimiento de la aplicación.", "Opción 1"], "correcta": "1"}, "pregunta-58": {"name": "<strong>58) ¿Cuáles son los dos tipos de almacenamiento web en HTML5?</strong>", "opciones": ["Tipos de almacenamiento de HTML5:<br> <strong>Almacenamiento de sesiones:</strong> Almacena sólo datos de la sesión actual. Lo que significa que los datos almacenados durante la sesión se borrarán de forma automática cuando se cierre el navegador.<br> <strong>Almacenamiento local:</strong> El almacenamiento local es otro tipo de almacenamiento Web HTML5. En el almacenamiento local, los datos no se borran automáticamente cuando se cierre la ventana del navegador actual.", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-59": {"name": "<strong>59) ¿Qué es el Application Cache en HTML5 y por qué se utiliza?</strong>", "opciones": ["Opción 1", "Opción 1", "Es &nbsp;una aplicación web que está almacenada en caché. Puede ser accesible sin tener conexión a Internet. Algunas ventajas de Application Cache:<br><strong>Navegación fuera de línea</strong> - Los usuarios pueden usar la aplicación cuando están fuera de línea.<br><strong>Velocidad</strong> - cargan más rápido los recursos con caché.<br><strong>Reducir la carga del servidor</strong> - El navegador web solo descargará los recursos actualizados del servidor."], "correcta": "2"}, "pregunta-60": {"name": "<strong>60) Explique cinco nuevos tipos de entrada proporcionados por HTML5 para formularios</strong>", "opciones": ["Opción 1", "Los nuevos e importantes tipos de datos que ofrece HTML5 son:<br> <strong>Fecha:</strong> Ofrece al usuario oportunidad de seleccionar una fecha.<br> <strong>Fecha-hora-local</strong>: Este entrada permite al usuario escoger una fecha y hora sin zona horaria.<br> <strong>Hora de la cita</strong>: Esta entrada ofrece al usuario seleccionar una fecha y hora con zona horaria.<br> <strong>Mes:</strong> Da oportunidad &nbsp;al usuario de seleccionar un mes y un año<br> <strong>Correo electrónico</strong>: Estos campos de entrada contienen un correo electrónico o dirección", "Opción 1"], "correcta": "1"}}, "javascript": {"pregunta-1": {"name": "<strong>1. ¿Qué es JavaScript?</strong>", "opciones": ["Opción 1", "JavaScript es un lenguaje de programación que ha sido concebido para profesionales y todos los que se desenvuelven en el desarrollo de paginas web. Es un lenguaje que funciona del lado del cliente y servidor, por tanto, son los navegadores los que se ocupan de interpretar el lenguaje Javascript. Vale resaltar que JavaScript no es lo mismo que Java.", "Opción 1"], "correcta": "1"}, "pregunta-2": {"name": "<strong>2. Enumera las diferencias entre Java y JavaScript</strong>", "opciones": ["Las principales diferencias son: <br><ol><li><strong>JavaScript</strong> ha sido un lenguaje interpretado, y <strong>Java</strong> compilado. Los programas de <strong>JavaScript</strong> son archivos de texto que se integra directamente en las páginas HTML y es interpretado (sin estar compilado) por el cliente (navegador), mientras que en <strong>Java</strong> se compilan a un archivo especial para que ser optimizados a un lenguaje intermedio llamado bytecode, y leído posteriormente en un ordenador que lo ejecute.</li><li><strong>Java</strong> es un lenguaje de programación orientado a objetos puros (OOP), mientras que <strong>JavaScript</strong> está basado en prototipos y, puede emular la programación orientada a objetos.</li><li><strong>JavaScript</strong> es gestionado por ECMAScript, una organización sin ánimo de lucro. En <strong>Java</strong>, el control lo tiene Oracle, una empresa privada que lo gestiona en función de sus intereses.</li><li><strong>JavaScript</strong> se depura en una fase y Java en dos. JavaScript hace que el código trabaje informando de los errores que se producen a medida que se ejecutando. <strong>Java</strong>, primero hace la fase de compilación y el compilador nos indica los posibles errores de sintaxis presentes en nuestro código. Después, se ejecuta el programa, donde pueden surgir errores para ser depurados.</li><li><strong>Java</strong> tiene variables definidas que no se pueden cambiar y es más complejo, <strong>JavaScript</strong> puede ser cambiante, dándole flexibilidad y es más sencillo.</li><li>&nbsp;<strong>JavaScript</strong> es débilmente tipado, una misma variable puede contener primero un texto, luego un número, un array o un objeto. Esto, que parece una ventaja, también es fuente de posibles errores si no controlamos correctamente lo que ocurre en nuestro código. <strong>Java</strong> es fuertemente tipado, todas las variables tienen un tipo determinado y, una vez definidas, no se pueden cambiar.</li></ol>", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-3": {"name": "<strong> 3. </strong><strong>¿Cuales son los tipos de datos JavaScript?</strong>", "opciones": ["Opción 1", "Opción 1", "Los tipos de datos JavaScript son: String, booleano, Objeto, Número, Indefinido."], "correcta": "2"}, "pregunta-4": {"name": "<strong>4. ¿Para qué sirve la función isNaN?</strong>", "opciones": ["Opción 1", "La función isNan devuelve verdadero si el argumento no es un número porque de lo contrario arrojaría un falso.", "Opción 1"], "correcta": "1"}, "pregunta-5": {"name": "<strong>5. Entre JavaScript y un script ASP, ¿cual es más rápido?</strong>", "opciones": ["JavaScript es más rápido porque es un lenguaje del lado del cliente y no necesita la ayuda del servidor web para ejecutarse. Por otra parte el ASP es un lenguaje del lado del servidor. Motivo por el que siempre es más lento que JavaScript. Sin embargo, Javascript ahora, también puede ser usado como un lenguaje de lado del servidor (server side) (nodejs).", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-6": {"name": "<strong>6. ¿Qué es el infinito negativo?</strong>", "opciones": ["Opción 1", "Infinito Negativo es un número en JavaScript que puede ser derivado, al dividir el número negativo entre cero.", "Opción 1"], "correcta": "1"}, "pregunta-7": {"name": "<strong> 7. ¿Es posible dividir el código JavaScript en varias líneas?</strong>", "opciones": ["Opción 1", "Opción 1", "Si, haciendo una declaracion string con el uso de una barra invertida (slash), '\\', al terminar la primera línea."], "correcta": "2"}, "pregunta-8": {"name": "<strong> 8. ¿Qué empresa desarrolló JavaScript?</strong>", "opciones": ["Opción 1", "La compañía de software Netscape fue quien desarrolló el JavaScript.", "Opción 1"], "correcta": "1"}, "pregunta-9": {"name": "<strong>9. ¿Qué son las variables no declaradas y no definidas?</strong>", "opciones": ["<strong>Variables no declaradas</strong>: son las que no existen en un programa, y no se declaran. Si el programa trata de leer su valor entonces va a arrojar un error.<br><strong>Variables no definidas</strong>: son aquellas declaradas en el programa, pero no tienen asignado ningún valor. Si el programa quiere leer el valor de &nbsp;variable no definida, se devuelve un valor no definido.", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-10": {"name": "<strong>10. Escriba un código para añadir nuevos elementos dinámicamente</strong>", "opciones": ["&lt;html&gt;&lt;head&gt;&lt;title&gt; Añadiendo elementos de forma dinámica con nodos de texto &lt;/title&gt; &lt;/head&gt; &lt;body&gt; &lt;div  id=\"nodo-texto\"&gt;&lt;/div&gt; &lt;script type=\"application/javascript\"&gt; var elemento = document.createElement(\"H1\") // Creamos un elemento del tipo h1 var texto = document.createTextNode(\"Este es un texto creado a través de un nodo de texto\"); // Creamos un texto con un nodo de texto elemento.appendChild(texto); // Agregamos el nodo de texto al elemento document.getElementById('nodo-texto').appendChild(elemento) // Para podemos mostrarlo en el DOM lo seleccionamos el div donde lo queremos introducir y le pasamos como hijo el h1 &lt;/script&gt; &lt;/body&gt; &lt;/html&gt;", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-11": {"name": "<strong>11. ¿Qué son las variables globales, cómo se declaran estas variables y cuáles son los problemas asociados con su uso?</strong>", "opciones": ["Opción 1", "Las variables globales son las que están a disposición para utilizar en todo el código, esto quiere decir, que no tienen alcance. La palabra clave (var) es utilizada para declarar una variable u objeto local. Si la palabra clave (var) es omitida, se declara como variable global.", "Opción 1"], "correcta": "1"}, "pregunta-12": {"name": "<strong>12. ¿Qué es un cuadro de diálogo?</strong>", "opciones": ["Opción 1", "Opción 1", "Es un cuadro que permite al usuario introducir datos, mediante un cuadro de texto. La etiqueta y el cuadro se suministrarán para que se pueda ingresar el texto o el número."], "correcta": "2"}, "pregunta-13": {"name": "<strong> 13. ¿Qué significa la palabra clave 'this' en JavaScript?</strong>", "opciones": ["La palabra clave 'this' se refiere al objeto desde donde fue llamado. ", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-14": {"name": "<strong>14. Explique el funcionamiento de los temporizadores en JavaScript y las desventajas de usarlos, si las hay.</strong>", "opciones": ["Opción 1", "Los temporizadores se usan para ejecutar un fragmento de código en un momento determinado o para repetir el código en un espacio de tiempo señalado. Esto se hace utilizando las funciones setTimeout, setInterval y clearInterval,<br> La función <strong>setTimeout</strong> (function, delay), es una funcion que se usa para iniciar un temporizador que llama a una funcion luego del retardo especificado. La función <strong>setInterval</strong> (function, delay) es utilizada para ejecutar repetidamente una función el el retardo (delay) que se especifique y solo se detiene cuando se cancela. La función <strong>clearInterval</strong>(id) es la que señala&nbsp; al temporizador que se pare. <br>Los temporizadores funcionan dentro de un hilo único, debido a esto, &nbsp;los eventos pueden quedar 'en cola', a la espera de ser ejecutados. ", "Opción 1"], "correcta": "1"}, "pregunta-15": {"name": "<strong> 15. ¿Qué símbolo se utiliza para los comentarios en Javascript?</strong>", "opciones": ["Opción 1", "Opción 1", "Se usa (//) para comentarios de una sola línea<br>Para comentarios multi-linea se abre con (/*) y se cierra con (*/). "], "correcta": "2"}, "pregunta-16": {"name": "<strong>16. ¿Cuál es la diferencia entre ViewState y SessionState?</strong>", "opciones": ["ViewState es muy específico para la página de una sesión.<br>SessionState es específico para los datos del usuario, a los que se entra en las páginas de la aplicación web. ", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-17": {"name": "<strong>17. ¿Qué es el operador ===?</strong>", "opciones": ["El operador (===) es llamado operador de igualdad estricta, el cual arroja verdadero (true) cuando los dos operandos poseen el mismo valor sin ningún tipo de conversión.", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-18": {"name": "<strong>18. Explique cómo se puede enviar un formulario usando JavaScript.</strong>", "opciones": ["Opción 1", "Si, se puede hacer usando: document.form[0].submit();", "Opción 1"], "correcta": "1"}, "pregunta-19": {"name": "<strong>19. ¿JavaScript es compatible con la conversión de tipos automática (automatic type conversion)?</strong>", "opciones": ["Sí, Javascript es compatible con los tipos de &nbsp;conversión automática. Es un tipo de conversión muy usada por los desarrolladores de JavaScript.", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-20": {"name": "<strong> 20. ¿Cómo se puede cambiar el estilo/clase de un elemento?</strong>", "opciones": ["Opción 1", "De la siguiente forma: document.getElementById(\"myText\").style.fontSize = \"20?;<br> o de esta otra: document.getElementById(\"myText\").className = \"anyclass\";", "Opción 1"], "correcta": "1"}, "pregunta-21": {"name": "<strong>21. Explica cómo leer y escribir un archivo usando JavaScript.</strong>", "opciones": ["Opción 1", "Opción 1", "Hay dos formas de leer y escribir un archivo usando JavaScript:<br>-Utilizando extensiones JavaScript.<br>-A través de una página web y objetos ActiveX."], "correcta": "2"}, "pregunta-22": {"name": "<strong> 22. ¿Cuáles son todos los bucles en JavaScript?</strong>", "opciones": ["Las estructuras de bucles en Javascript son: For, While, Do-While y forEach", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-23": {"name": "<strong>23. ¿A qué se le llama tipificación de variables (variable typing) en Javascript?</strong>", "opciones": ["Opción 1", "La tipificación de variables se usa para asignar un número a una variable, y esta misma variable se puede asignar a un string. <strong>Ejemplo</strong>: i = 10; i = \"cadena\";", "Opción 1"], "correcta": "1"}, "pregunta-24": {"name": "<strong>24. ¿Cómo se puede convertir un string de cualquier base a un entero en JavaScript?</strong>", "opciones": ["Opción 1", "Opción 1", "A través del uso de la función parseInt(), ya que, esta función toma el string a convertir como primer parámetro, y como segundo parámetro usa la base del string dado. Para convertir 4F (de base 16) a entero, el código utilizado será: <br>parseInt (\"4F\", 16);"], "correcta": "2"}, "pregunta-25": {"name": "<strong>25. Explica la diferencia entre '==' y '===='</strong>", "opciones": ["Opción 1", "Opción 1", "La diferencia es que (\"==\") chequea solamente la igualdad de valor, pero (\"====\") es la prueba de igualdad más estricta y además, devuelve falso si el tipo o el valor de las dos variables es distinto."], "correcta": "2"}, "pregunta-26": {"name": "<strong>26. ¿Cuál sería el resultado de 3+2+''7''?</strong>", "opciones": ["Dado que 3 y 2 son números enteros, se sumarán numéricamente. Y como el 7 es una cadena, se va a aplicar su concatenación, así que el resultado en este caso sería 57.", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-27": {"name": "<strong>27. ¿Cómo se puede detectar el sistema operativo de la máquina del cliente?</strong>", "opciones": ["Opción 1", "Opción 1", "Es necesario usar la cadena navigator.platform"], "correcta": "2"}, "pregunta-28": {"name": "<strong>28. ¿Qué significa NULL en Javascript?</strong>", "opciones": ["El valor (NULL) es utilizado para representar a ningún valor o ningún objeto. Esto quiere decir, que no representa a ningún objeto o cadena,&nbsp; ni valor booleano, ni&nbsp; número u objeto de un array.", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-29": {"name": "<strong>29. ¿Cuál es la función del operador delete?</strong>", "opciones": ["Opción 1", "La palabra clave (delete) es usada para eliminar la propiedad, así como su valor. ", "Opción 1"], "correcta": "1"}, "pregunta-30": {"name": "<strong>30. ¿Qué es un valor no definido en JavaScript?</strong>", "opciones": ["Opción 1", "Opción 1", "Un valor no definido significa que: <br>-La variable usada en el código no existe.<br> -La variable no está acreditada a ningún valor.<br>-La propiedad no existe. "], "correcta": "2"}, "pregunta-31": {"name": "<strong>31. ¿Cuáles son todos los tipos de ventanas emergentes disponibles en JavaScript?</strong>", "opciones": ["Alerta (alert), Confirmar (confirm) y Entrada por teclado(prompt). <br>alert<br>('Esto es una alerta')<br>confirm('Esto es una ventana de confirmación con un mensaje', true)<br>prompt('Esto es una entrada por teclado, introduce cualquier valor:  ')<br>", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-32": {"name": "<strong>32. ¿Para qué se utiliza Void (0)?</strong>", "opciones": ["Opción 1", "Se usa Void(0) para prevenir que la página sea actualizada. También, se usa para llamar a otro método sin que se actualice la página.", "Opción 1"], "correcta": "1"}, "pregunta-33": {"name": "<strong>33. </strong><strong>¿Cómo se puede forzar a una página a cargar otra página en JavaScript?</strong>", "opciones": ["Opción 1", "Se puede usar el siguiente código para lograr objetivo deseado.<br>&lt;script type=\"text/application/javascript\" &gt; <br> document.location.href = 'https://www.google.co.ve/'; <br> &lt;/script&gt;", "Opción 1"], "correcta": "1"}, "pregunta-34": {"name": "<strong>34. ¿Cuál es el tipo de datos de variables en JavaScript?</strong>", "opciones": ["Todas las variables en JavaScript son del tipo objetos. ", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-35": {"name": "<strong>35. ¿Cuál es la diferencia entre un cuadro de alerta y un cuadro de confirmación?</strong>", "opciones": ["Opción 1", "Opción 1", "El cuadro de alerta sólo muestra un botón, el botón OK. El cuadro de confirmación presenta dos botones: el de OK y Cancelar. "], "correcta": "2"}, "pregunta-36": {"name": "<strong>36. ¿Qué son los caracteres de escape?</strong>", "opciones": ["Opción 1", "Opción 1", "Los caracteres de escape (barra invertida) son utilizados para trabajar con caracteres especiales, entre ellos; comillas dobles, comillas simples, símbolos y apóstrofes.<strong>Ejemplo:</strong><br>document.write \"I m a \"good\" boy\"<br>document.write \"I m a \\\"good\\\" boy\""], "correcta": "2"}, "pregunta-37": {"name": "<strong>37. ¿Qué son las cookies de JavaScript?</strong>", "opciones": ["Son archivos pequeños de prueba que se guardan en un ordenador y &nbsp;se crean cuando el usuario visita los sitios web para guardar información&nbsp; necesaria.", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-38": {"name": "<strong>38. Explique el método pop()en JavaScript.</strong>", "opciones": ["Opción 1", "El método pop() es un método parecido al método shift(), con la diferencia de que el Shift funciona al comienzo del array. También, el método pop() aparta el último elemento del array dado y lo devuelve. Por ello, el array que llama es entonces alterado. <strong>Ejemplo:</strong>var ropa= [\"Camisa\", \"Pantalón\", \"Franela\"];<br>ropa.pop();<br>//Ahora ropa se convierte en camisa, pantalón.", "Opción 1"], "correcta": "1"}, "pregunta-39": {"name": "<strong>39. Mencione cual es la desventaja de usar innerHTML en JavaScript.</strong>", "opciones": ["Si se usa innerHTML en JavaScript la desventaja es:<br>-Se reemplaza el contenido en todas partes<br>-El contenido innerHTML es re-analizado y elaborado en elementos, lo que hace que sea mucho más lento.<br>-El innerHTML no suministra validación, por lo tanto, potencialmente se puede insertar HTML válido y no válido en el documento y dañarlo.", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-40": {"name": "<strong>40. ¿Qué son las declaraciones break y continue?</strong>", "opciones": ["Opción 1", "La declaración Break sirve para salir del bucle actual. La declaracion continue sirve para continuar con la próxima sentencia del bucle.", "Opción 1"], "correcta": "1"}, "pregunta-41": {"name": "<strong>41. ¿Cuáles son los dos grupos básicos de tipos de datos en JavaScript?</strong>", "opciones": ["Opción 1", "Opción 1", "<strong>Primitivos:</strong> Son el número y &nbsp;tipos de datos booleanos.<br><strong>Tipos de referencia</strong>: son los tipos más complejos, como las string y las fechas. "], "correcta": "2"}, "pregunta-42": {"name": "<strong>42. ¿Cómo se pueden crear objetos genéricos?</strong>", "opciones": ["Opción 1", "Opción 1", "Los objetos genéricos se pueden crear como:<br>var myObjeto = new Object({ 'nombre': 'Diego', 'apeliido': 'Querales', 'edad': 25, }) <br> // Salida por consola<br> {nombre: \"Diego\", apeliido: \"Querales\", edad: 25}"], "correcta": "2"}, "pregunta-43": {"name": "<strong>43. ¿Para qué sirve el operador typeof?</strong>", "opciones": ["Opción 1", "Typeof': es un operador que se usa para regresar una descripción de cadena del tipo de una variable.", "Opción 1"], "correcta": "1"}, "pregunta-44": {"name": "<strong>44. ¿Qué palabras clave se usan para manejar las excepciones?</strong>", "opciones": ["Try, Catch y Finally son las que se utilizan para manejar excepciones en lenguaje JavaScript<br>Try{ <br>Code<br> } Catch(exp){<br>Código para lanzar una excepción <br> } <br> Finally <br> El código se ejecuta o bien termina con éxito después del catch. <br> }", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-45": {"name": "<strong>45. ¿Qué palabra clave se utiliza para mostrar un texto en pantalla?</strong>", "opciones": ["Opción 1", "Opción 1", "document.write (\"Bienvenido\") se usa para imprimir el texto - 'Bienvenido' en la pantalla."], "correcta": "2"}, "pregunta-46": {"name": "<strong>46. ¿Para qué sirve el evento blur?</strong>", "opciones": ["Opción 1", "El evento blur es usado para desaparecer el enfoque del objeto especifico. <br> <strong>Código Javascript</strong><br> var myForm = document.getElementById(\"form\"); <br> myForm.addEventListener(\"focus\", function (event) { <br> event.target.style.background = \"pink\"; <br> }, true); <br> myForm.addEventListener(\"blur\", function (event) { <br> event.target.style.background = \"\"; <br> }, true);<br> <strong>Código HTML</strong><br>&lt;form id=\"form\"&gt;<br> &lt;input type=\"text\" placeholder=\"text input\"&gt; <br> &lt;input type=\"password\" placeholder=\"password\"&gt; <br> &lt;/form&gt;", "Opción 1"], "correcta": "1"}, "pregunta-47": {"name": "<strong>47. ¿Qué es la tipificación de variables?</strong>", "opciones": ["Opción 1", "Opción 1", "La tipificación de variables, sirve para asignar un número a una variable y después asignar un string a la misma variable. <strong>Ejemplo:</strong>i= 8; i=\"john\";"], "correcta": "2"}, "pregunta-48": {"name": "<strong>48. ¿Cómo puedo saber la versión del navegador que está usando el cliente?</strong>", "opciones": ["Mediante navigator.appVersion se puede conseguir la versión del navegador que está usando el cliente ", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-49": {"name": "<strong>49. ¿Cuáles son los diferentes tipos de errores en JavaScript?</strong>", "opciones": ["Opción 1", "Opción 1", "Se pueden encontrar tres tipos de errores: <strong>-Errores de tiempo de carga</strong>: Son los errores que se originan al cargar una página web, como son los errores de sintaxis inadecuados, los cuales se conocen como errores de tiempo de carga y producen los errores dinámicamente. <strong>-Errores de tiempo de ejecución</strong>: Son los errores producidos motivado al mal uso del comando dentro del lenguaje HTML. <strong>-Errores lógicos:</strong> Estos errores se producen debido a la mala lógica realizada en una función que tiene una operación distinta."], "correcta": "2"}, "pregunta-50": {"name": "<strong>50. ¿Para qué sirve el método Push en JavaScript?</strong>", "opciones": ["El método push es el utilizado para añadir o añadir uno o más elementos al final de un Array. Cuando se usa este método, se pueden añadir múltiples elementos pasando múltiples argumentos.", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-51": {"name": "<strong>51. ¿Qué es el método unshift en JavaScript?</strong>", "opciones": ["Opción 1", "Unshift es un método parecido al método push, el cual funciona al comienzo del array. Este método es usado para anteponer uno o varios elementos al comienzo del array.", "Opción 1"], "correcta": "1"}, "pregunta-52": {"name": "<strong>52. ¿Cuál es la diferencia entre JavaScript y Jscript?</strong>", "opciones": ["Opción 1", "Opción 1", "Los dos son muy similares. JavaScript fue desarrollado por Netscape y Jscript fue desarrollado por Microsoft."], "correcta": "2"}, "pregunta-53": {"name": "<strong>53.  </strong><strong>¿Cómo se asignan las propiedades a los objetos?</strong>", "opciones": ["Las propiedades se asignadas a los objetos de la siguiente forma: obj[\"class\"] = 12; <br> o también como: obj.class = 12;", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-54": {"name": "<strong>54. ¿Qué es el modo 'Estricto' (Strict) en JavaScript y cómo se puede habilitar?</strong>", "opciones": ["El modo estricto (strict) en JavaScript muestra los errores de un fragmento de código que anteriormente no mostraba ningún error. Pero que puede ser problemático e inseguro. En este modo también, se resuelven varios errores que dificultan la función eficiente de los motores de JavaScript. El modo estricto puede ser activado agregando la cadena \"use strict\" sobre el archivo. Esto se puede mostrar con el siguiente ejemplo:<br>function myfunction() {<br> \"use strict\"; <br> var v = \"Esta es una función de modo estricto\"; <br> }", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-55": {"name": "<strong>55. ¿Cuál es la forma de obtener el estado de un CheckBox?</strong>", "opciones": ["Opción 1", "Opción 1", "El status se puede adquirir de la siguiente forma.<br>alert(document.getElementById('checkbox1').checked);<br> Si la casilla de verificación está marcada, esta alerta devolverá 'True'."], "correcta": "2"}, "pregunta-56": {"name": "<strong>56. Explique para que sirve window.onload y onDocumentReady.</strong>", "opciones": ["Opción 1", "El evento onload no se ejecuta hasta después que se cargue toda la información de la página. Esto produce un retraso sustancial antes de que se ejecute cualquier código. Por otro lado, el evento onDocumentReady permite cargar el código justo después de cargar el DOM. Esto permite manipular el código tempranamente. ", "Opción 1"], "correcta": "1"}, "pregunta-57": {"name": "<strong> 57. ¿Cómo funcionan los 'closures'  en JavaScript? ¿Cuándo se utilizan?</strong>", "opciones": ["El closure es una variable declarada localmente y que está relacionada con una función que sigue en memoria cuando la función ha regresado. <strong>Ejemplo:</strong> <br> function saludo(mensaje) { <br> console.log(mensaje); <br> } <br> function saludar(nombre, edad) { <br> return nombre +\" dice Hola! tengo\" + edad + \" años\"; <br> } <br> // Generar el mensaje <br> var mensaje= saludar(\"Rafael\", 32); <br> // Explícitamente para saludar <br> saludo(mensaje); <br> Esta función se puede representar mejor usando cierres: <br> function saludar(nombre, edad) { <br> var mensaje= nombre + \"dice Hola! tengo\" + edad + \" años\"; <br> return function saludo() { <br> console.log(mensaje); <br> }; <br> } <br> // Generar el closure <br> var Rafael= saludar(\"Rafael\", 32); <br> // Usa el cierre <br> Rafael(); ", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-58": {"name": "<strong>58. ¿Cómo se puede añadir un valor a un array?</strong>", "opciones": ["Opción 1", "Un valor puede ser agregado a un array de la siguiente manera: arr[arr.length] = valor;", "Opción 1"], "correcta": "1"}, "pregunta-59": {"name": "<strong>59. ¿Explica el bucle de for-in?</strong>", "opciones": ["Opción 1", "Opción 1", "El bucle for-in, es usado para hacer un ciclo a través de las propiedades que tiene&nbsp; un objeto. La sintaxis del bucle for-in es: <br> for(nombre-de-la-variable in objeto){<br>bloque a ejecutar aqui<br>}<br> En cada repetición, una propiedad del objeto es asociada al nombre de la variable, y el bucle sigue hasta que se terminen todas&nbsp; las propiedades del objeto."], "correcta": "2"}, "pregunta-60": {"name": "<strong>60. Describa las propiedades de una función anónima en JavaScript.</strong>", "opciones": ["Opción 1", "Una función anónima es la que se declara sin ningún identificador nombrado. Es decir, la función anónima es inaccesible después de su declaración.<br>Declaración de función anónima:<br>var anon = function() { <br> alert('Soy anónimo'); <br> };<br> anon(); <br> ", "Opción 1"], "correcta": "1"}, "pregunta-61": {"name": "<strong>61. ¿Cuál es la diferencia entre .call() y .apply()?</strong>", "opciones": ["Las funciones .call() y .apply() son &nbsp;similares en cuanto a su uso, pero tienen una pequeña diferencia. Esto se debe a que, .call() se utiliza cuando el programador conoce el número de argumentos de la función, porque se deben mencionar como argumentos en la sentencia/declaración de llamada. Por otra parte, .apply() se usa cuando no se conoce el número. Entonces, apply() espera que el argumento sea un array. Así pues, la diferencia básica entre ambas .call() y .apply(), está basada, en la forma en que pasan los argumentos a la función. Su uso se puede ilustrar con el siguiente ejemplo:<br> var unObjeto = { <br> miPropiedad : 'Foo', <br> miMetodo : function(prefijo, sufijo) { <br> alert(prefijo + this.miPropiedad +sufijo); <br> } <br> }; <br> unObjeto.miMetodo('&lt;', '&gt;'); // alerts &lt;Foo&gt;''. <br> var otroObjeto = { <br> miPropiedad : 'Bar' <br> }; <br> otroObjeto.miMetodo.call(otroObjeto, '&lt;', '&gt;'); // alerta '&lt;Bar&gt;'. <br> otroObjeto.miMetodo.apply(otroObjeto, ['&lt;', '&gt;']); // alerta '&lt;Bar&gt;'", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-62": {"name": "<strong>62. Defina el burbujeo de eventos (Event Bubbling)</strong>", "opciones": ["Opción 1", "Opción 1", "JavaScript permite que los elementos DOM estén anidados uno dentro del otro. Es decir, si se hace clic en el controlador del hijo (child handler), el controlador del parent (parent handler) va a funcionar como si también se hubiera hecho clic en el de él."], "correcta": "2"}, "pregunta-63": {"name": "<strong>63. ¿Es JavaScript sensible a mayúsculas y minúsculas? </strong>", "opciones": ["Opción 1", "Sí, JavaScript diferencia entre las &nbsp;mayúsculas y las minúsculas. Un ejemplo es, una función parseInt, no es la misma que la función Parseint. ", "Opción 1"], "correcta": "1"}, "pregunta-64": {"name": "<strong>64. ¿Qué operadores booleanos se pueden utilizar en JavaScript?</strong>", "opciones": ["Pueden utilizarse el operador 'And' (&amp;&amp;), el operador'Or' (||) y el operador 'Not' (!). Los operadores no llevan los paréntesis.", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-65": {"name": "<strong>65. ¿Cómo se puede seleccionar un frame en particular desde un hipervínculo en JavaScript?</strong>", "opciones": ["Opción 1", "Opción 1", "Se puede hacer introduciendo el nombre del frame requerido en el hipervínculo y usando el atributo 'target'.<br>&lt;a href=\"/nueva.htm\" target=\"newframe\"&gt;&gt;Nueva Página &lt;/a&gt;"], "correcta": "2"}, "pregunta-66": {"name": "<strong>66. ¿Cuál es la regla de las  de las declaraciones break y continue?</strong>", "opciones": ["La declaración Break se usa para salir del bucle actual, mientras que&nbsp; la sentencia continue continúa el bucle actual pero con nueva recurrencia.", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-67": {"name": "<strong>67. ¿Cual es la diferencia entre un web-garden y una web-farm?</strong>", "opciones": ["Opción 1", "web-garden y web-farm son sistemas de alojamiento web. La única diferencia es que web-garden es una configuración que tiene muchos procesadores en un solo servidor, mientras que web-farm es una configuración más grande, por lo tanto, utiliza más de un servidor.", "Opción 1"], "correcta": "1"}, "pregunta-68": {"name": "<strong>68. ¿Cómo se asignan las propiedades de los objetos?</strong>", "opciones": ["Opción 1", "Opción 1", "La asignación de propiedades a objetos se hace de la misma forma que se asigna un valor a una variable. <strong>Ejemplo</strong>: document.form.action=\"submit\" "], "correcta": "2"}, "pregunta-69": {"name": "<strong>69. ¿Cuál es el método para leer y escribir un archivo en JavaScript?</strong>", "opciones": ["Opción 1", "Se puede hacer utilizando extensiones JavaScript (se ejecuta desde el editor JavaScript). <strong>Ejemplo</strong>, para abrir un archivo.<br>fh = fopen(getScriptPath(), 0);", "Opción 1"], "correcta": "1"}, "pregunta-70": {"name": "<strong>70. ¿Cómo se utiliza DOM en JavaScript?</strong>", "opciones": ["DOM (Modelo de objeto de documento) es responsable de la manera en que varios objetos de un documento interactúan entre sí. DOM es necesario para el desarrollo o creación de páginas web que poseen objetos como: enlaces, párrafos, entre otros. Estos objetos pueden ser operados para incluir acciones como agregar o eliminar. DOM, es necesario también para agregar capacidades adicionales a una página web. Asimismo, el uso de API proporciona una ventaja sobre otros modelos existentes.", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-71": {"name": "<strong>71. ¿Cómo se utilizan los manejadores de eventos en JavaScript?</strong>", "opciones": ["Los eventos son acciones que resultan de las actividades, como: hacer clic en un enlace o rellenar un formulario por parte del usuario. Es necesario un gestor de eventos para gestionar la ejecución de forma correcta de todos los eventos. El manejador de eventos son un atributo extra del objeto. Este atributo tiene el nombre del evento y la acción tomada, si el evento ocurre. ", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-72": {"name": "<strong>72. Explique el papel de los scripts diferidos en JavaScript.</strong>", "opciones": ["Opción 1", "Por defecto, el análisis del código HTML, mientras se carga la página se pausa hasta que el script no se haya dejado de ejecutar. Es decir, si el servidor es lento o el script es pesado, la página web se muestra con un retraso. Si se usa un script diferido (Deferred), se retarda la ejecución del script hasta el momento en que se ejecuta el analizador de HTML. Esto disminuye el tiempo de carga de las páginas web y se muestran más rápido al usuario. ", "Opción 1"], "correcta": "1"}, "pregunta-73": {"name": "<strong>73. ¿Cuáles son los distintos componentes funcionales de JavaScript?</strong>", "opciones": ["Opción 1", "Opción 1", "Los distintos componentes funcionales de JavaScript son:<br><strong>Funciones de primera clase</strong>: Las funciones de JavaScript se usan como objetos de primera clase. Esto significa que las funciones, se pueden pasar como argumentos a otras funciones, devueltas como valores de otras funciones, asignadas a variables o&nbsp; pueden ser guardadas en estructuradas de datos.<br> <strong>Funciones anidadas</strong>: Son las funciones, que se definen dentro de otras funciones. Se llaman `cada vez que' se nombra la función principal. "], "correcta": "2"}, "pregunta-74": {"name": "<strong>74. Comente sobre los errores que se pueden mostrar en JavaScript.</strong>", "opciones": ["Opción 1", "Opción 1", "JavaScript emite un mensaje si se encuentra un error. Los errores reconocidos son:<br><strong>Errores en el tiempo de carga</strong>: Estos errores se encuentran al usar la sintaxis de forma incorrecta, y por tanto, se detectan mientras la página se está cargando. Por <strong>ejemplo</strong>: los errores en el momento de la carga de la página, se cuentan como errores de tiempo de carga<br><strong>Errores en tiempo de ejecución</strong>: Este error &nbsp;aparece mientras el programa está en ejecución. Es causado por operaciones como por&nbsp; <strong>ejemplo</strong>, división de un número por cero, o por intentar entrar a un área inexistente de la memoria.<br><strong>Errores de lógica:</strong> son causados por el uso de un código correcto sintácticamente pero que no cumple con la tarea requerida, <strong>ejemplo</strong>, un bucle infinito."], "correcta": "2"}, "pregunta-75": {"name": "<strong> 75. </strong><strong>¿Qué son los objetos de pantalla?</strong>", "opciones": ["Los objetos de pantalla sirven para leer la información de la pantalla del cliente. Sus propiedades&nbsp; son:<br>-AvailHeight: Da la altura de la pantalla del cliente<br>-AvailWidth: Da el ancho de la pantalla del cliente.<br>-ColorDepth: suministra la profundidad de bits de las imágenes en la pantalla del cliente<br>-Altura: Proporciona la altura general de la pantalla del cliente, incluye la barra de tareas.<br>-Ancho: muestra el ancho total de la pantalla del cliente, incluye la barra de tareas.", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-76": {"name": "<strong>76. Explique el método unshift()</strong>", "opciones": ["Opción 1", "Opción 1", "El método unshift(), es funcional al iniciar un array, a diferencia de push(). Este agrega el número deseado de elementos a la parte superior de un array. <strong>Ejemplo:</strong> <br>var nombre = [ \"jose\" ];<br> name.unshift (\"eduardo\"); <br> name.unshift (\"pedro\", \"juana\"); <br> console.log(nombre);<br> La salida se muestra a continuación:<br> [\" pedro\",\" juana\", \" eduardo\", \" juan\"] "], "correcta": "2"}, "pregunta-77": {"name": "<strong>77. Defina las funciones escape() y unescape()</strong>", "opciones": ["Opción 1", "-La función <strong>escape()</strong> es la responsable de codificar un string para hacer el pase de información de un ordenador hacia el otro, a través de una red.<br><strong>Ejemplo:</strong><br>&lt;script&gt;<br>document.write(escape (\"Hola? Como estas tu?\"));<br>&lt;/script&gt; <br> Salida: Hola%3F%20Como%20estas%20tu%21 <br>-La función <strong>unescape()</strong> es&nbsp; importante&nbsp; porque es la que decodifica la cadena codificada.<br> <strong>Ejemplo:</strong><br>&lt;script&gt;<br>document.write(unescape(\"Hola%3F%20Como%20estas%20tu%21\"));<br>&lt;/script&gt;&gt;<br>Salida: Hola? Como estas tu? ", "Opción 1"], "correcta": "1"}, "pregunta-78": {"name": "<strong>78. ¿Qué hace decodeURI() y encodeURI()?</strong>", "opciones": ["Opción 1", "Opción 1", "EncodeURl(): es utilizado para convertir URL a su codificación hexadecimal. &nbsp;DecodeURI() se utiliza para convertir la URL codificada de vuelta a normal.<br> &lt;script&gt; <br> var uri=\"my test.asp?name=ståle&amp;car=saab\"; <br> document.write(encodeURI(uri)+ \"&lt;br&gt;\"); <br> document.write(decodeURI(uri)); <br> &lt;/script&gt;<br> Salida: my%20test.asp?name=st%C3%A5le&amp;car=saab <br>my test.asp?name=ståle&amp;car=saab "], "correcta": "2"}, "pregunta-79": {"name": "<strong>79. ¿Por qué no se recomienda utilizar innerHTML en JavaScript?</strong>", "opciones": ["Opción 1", "No se recomienda su uso porque es muy lento dado que refresca el contenido cada vez. Es más fácil insertar un código errado en el documento y hacer que la página web sea inestable.", "Opción 1"], "correcta": "1"}, "pregunta-80": {"name": "<strong>80. </strong><strong>¿Qué declara la siguiente declaración?</strong> var myArray = [[[]]]; ", "opciones": ["Declara un array tridimensional.", "Opción 1", "Opción 1"], "correcta": "0"}, "pregunta-81": {"name": "<strong>81. ¿Cómo se relacionan JavaScript y ECMA Script?</strong>", "opciones": ["Opción 1", "Opción 1", "ECMA Script son como reglas y directrices, mientras que Javascript es un lenguaje de scripting usado para el desarrollo web."], "correcta": "2"}, "pregunta-82": {"name": "<strong>82. ¿Qué es el namespacing en JavaScript y cómo se utiliza?</strong>", "opciones": ["Opción 1", "Namespacing se utiliza para agrupar funciones, variables, etc con un nombre único.&nbsp; Esto mejora la modularidad en codificación y permite la reutilización del código.", "Opción 1"], "correcta": "1"}, "pregunta-83": {"name": "<strong>83. ¿Cómo se pueden ocultar los códigos JavaScript de los navegadores antiguos que no soportan JavaScript?</strong>", "opciones": ["Opción 1", "Opción 1", "Para ocultar códigos JavaScript de navegadores antiguos con este código:<br> Añada \"&lt;!--\" sin las comillas en el código justo después de la etiqueta &lt;script&gt;. <br> Añada \"//--&gt;&gt;\" sin las comillas en el código justo antes de la etiqueta &lt;script&gt;.<br> Ahora los navegadores antiguos verán este código JavaScript como un comentario HTML. Mientras que, un navegador que soporte JavaScript, tomará los \"&lt;!--\" y \"//----&gt;\" como comentarios de una línea."], "correcta": "2"}}}